# GetAllRuleIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..GetAllRuleIds Method
PerformanceAdviser Class See Also
---
Retrieves an enumeration of rule Ids.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<PerformanceAdviserRuleId> GetAllRuleIds()
```

Visual Basic
---
```text
Public Function GetAllRuleIds As IList(Of PerformanceAdviserRuleId)
```

Visual C++
---
```text
public:
IList<PerformanceAdviserRuleId^>^ GetAllRuleIds()
```

# ### Return Value
A collection of rule Ids
# See Also
PerformanceAdviser Class
Autodesk.Revit.DB Namespace